identification division.
program-id. cat.

environment division.
configuration section.

data division.
working-storage section.

procedure division.
      display "hello world"
    goback.

end program cat.